<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"838b47d2460e010737c8531ffda34f23a9fb287f383ed408b44f393f0e5ea073","plan_job_ref":"Job Create Terraform plan (DEV) #110 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15046173984","plan_out_hash":"5ebf15c47b99a3207b81ceef807b178ca913caa0b85273814f071d24c4714551","plan_hash":"d2833aa2b2803bf10e07a29b8b27601239203834652ae75e0fe3d0314450c6e1","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # azurerm_role_assignment.aks-dns-role-by-id will be destroyed
  # (because azurerm_role_assignment.aks-dns-role-by-id is not in configuration)
-   resource "azurerm_role_assignment" "aks-dns-role-by-id" {
-       id                                     = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.Network/dnsZones/audioprothese.ovh/providers/Microsoft.Authorization/roleAssignments/f3572405-2378-178e-ecf1-ae28c39bea20" -> null
-       name                                   = "f3572405-2378-178e-ecf1-ae28c39bea20" -> null
-       principal_id                           = "a26bf469-b146-41c5-bbdb-37011bec7bf1" -> null
-       principal_type                         = "ServicePrincipal" -> null
-       role_definition_id                     = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> null
-       role_definition_name                   = "DNS Zone Contributor" -> null
-       scope                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.Network/dnsZones/audioprothese.ovh" -> null
-       skip_service_principal_aad_check       = true -> null
#        (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.aks_dns will be created
+   resource "azurerm_role_assignment" "aks_dns" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "************************************"
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "DNS Zone Contributor"
+       scope                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.Network/dnsZones/audioprothese.ovh"
+       skip_service_principal_aad_check = true
    }

  # kubectl_manifest.sa will be updated in-place
!~  resource "kubectl_manifest" "sa" {
        id                      = "/apis/cert-manager.io/v1/clusterissuers/letsencrypt-prod"
        name                    = "letsencrypt-prod"
!~      yaml_body               = (sensitive value)
!~      yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-prod
              namespace: cert-manager
            spec:
              acme:
                email: contact@audioprothese.ovh
                privateKeySecretRef:
                  name: letsencrypt-production
                server: https://acme-v02.api.letsencrypt.org/directory
                solvers:
                - dns01:
                    azureDNS:
                      environment: AzurePublicCloud
                      hostedZoneName: audioprothese.ovh
                      managedIdentity:
          -             clientID: a26bf469-b146-41c5-bbdb-37011bec7bf1
          +             clientID: 9e43cf1f-5d49-4129-9614-91546ffb7d00
                      resourceGroupName: rg-openmrscore-dev
                      subscriptionID: b33703ee-cc2d-4e8b-bd23-c259839be42e
        EOT
#        (13 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #110](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15046173984)